#1
x = int (input("Введите число 1 :"))
y = int (input("Введите число 2 :"))
if x>y:
    print(x)
else: (print(y))


#2
if (y%2)>0:
    print ("это число нечетное")
else: print ("это число четное")


#3
if (y>0):
    print ("положительное")
else:print ("отрицательное")


#4
x1 = int (input("Введите число 1 :"))
a = str(input("что необходимо сделать (+ - / *)"))
y1 = int (input("Введите число 2 :"))
if (a == "+"):
    print ("Сумма равна: " (x1+y1))
elif (a == "-"):
    print ("Разность равна: " (x1-y1))
elif (a == "/"):
    print ("Частное: " (x1/y1))
elif (a == "*"):
    print ("Произведение: " (x1*y1))
elif (a == "/")&(y1==0):
    print ("Частное: 0")

